{
  "attention": {
    "pats": {
      "Dog": {
        "Depressed": [
          {"type": "positive", "message": "You gently pet your dog. It wags its tail weakly, feeling a bit better.", "happiness": 4},
          {"type": "negative", "message": "You try to pet your dog, but it doesn't react much.", "happiness": -1},
          {"type": "hurt", "message": "As you reach out, your dog shifts away and accidentally knocks over its water bowl.", "happiness": -2, "health": -1}
        ],
        "Frustrated": [
          {"type": "positive", "message": "You pet your dog, and it lets out a huff before calming down.", "happiness": 6},
          {"type": "negative", "message": "Your dog pulls away, still too frustrated to enjoy the attention.", "happiness": -2},
          {"type": "hurt", "message": "Your dog jerks its head and bumps into a table, yelping slightly.", "happiness": -3, "health": -1}
        ],
        "Happy": [
          {"type": "positive", "message": "You pet your dog, and it wags its tail excitedly, licking your hand happily.", "happiness": 10},
          {"type": "negative", "message": "Your dog enjoys the pet but quickly gets distracted.", "happiness": 3},
          {"type": "hurt", "message": "Your dog gets so excited that it jumps up, trips over its own paws, and lands on its back.", "happiness": -2, "health": -2}
        ],
        "Sad": [
          {"type": "positive", "message": "You pet your dog, and it leans against you for comfort.", "happiness": 7},
          {"type": "negative", "message": "Your dog barely reacts to your petting, still looking downcast.", "happiness": -2},
          {"type": "hurt", "message": "Your dog sighs heavily and lays down too quickly, bumping its chin on the floor.", "happiness": -3, "health": -1}
        ],
        "Angry": [
          {"type": "positive", "message": "You pet your dog carefully, and it slowly relaxes.", "happiness": 5},
          {"type": "negative", "message": "Your dog stiffens but tolerates the petting.", "happiness": -2},
          {"type": "hurt", "message": "Your dog snaps its jaws in irritation and accidentally bites its own tongue.", "happiness": -3, "health": -2}
        ],
        "Afraid": [
          {"type": "positive", "message": "You pet your dog gently, and it leans into your touch for reassurance.", "happiness": 6},
          {"type": "negative", "message": "Your dog flinches slightly but stays put.", "happiness": -2},
          {"type": "hurt", "message": "Your dog gets startled and dashes away, slipping and hitting the wall.", "happiness": -4, "health": -2}
        ],
        "Excited": [
          {"type": "positive", "message": "You pet your dog, and it wiggles with joy.", "happiness": 10},
          {"type": "negative", "message": "Your dog is too hyper and barely registers the petting.", "happiness": 3},
          {"type": "hurt", "message": "Your dog jumps up excitedly and bonks its head on the table.", "happiness": -2, "health": -2}
        ],
        "Lonely": [
          {"type": "positive", "message": "You pet your dog, and it nuzzles into your hand happily.", "happiness": 8},
          {"type": "negative", "message": "Your dog accepts the pet but still seems down.", "happiness": 2},
          {"type": "hurt", "message": "Your dog is so eager for attention that it accidentally trips over itself.", "happiness": -3, "health": -1}
        ],
        "Playful": [
          {"type": "positive", "message": "You pet your dog, and it rolls over, demanding belly rubs.", "happiness": 9},
          {"type": "negative", "message": "Your dog wiggles too much to properly enjoy the pet.", "happiness": 4},
          {"type": "hurt", "message": "Your dog playfully nips but accidentally bites a little too hard.", "happiness": -2, "health": -1}
        ],
        "Annoyed": [
          {"type": "positive", "message": "You patted your dog, even though it seemed grumpy. It tolerated it.", "happiness": 3},
          {"type": "negative", "message": "Your dog huffed and turned away from your pat, clearly not in the mood.", "happiness": -1},
          {"type": "hurt", "message": "You patted your annoyed dog, and it playfully bit your hand a little too hard!", "happiness": -3, "health": -2}
        ],
        "Tired": [
          {"type": "positive", "message": "You pat your sleepy dog, and it lets out a relaxed sigh.", "happiness": 4},
          {"type": "negative", "message": "You tried to pat your dog, but it was too tired to care.", "happiness": 0},
          {"type": "hurt", "message": "You patted your dog, but it suddenly flopped over onto you, pinning you down!", "happiness": -2, "health": -1}
        ],
        "Bored": [
          {"type": "positive", "message": "You pat your dog, and it wags its tail a little, perking up slightly.", "happiness": 5},
          {"type": "negative", "message": "Your dog sighs, still looking for something fun to do.", "happiness": 1},
          {"type": "hurt", "message": "Your dog gets so bored it starts chewing on your shoe instead.", "happiness": -2, "health": -2}
        ],
        "Equal": [
          {"type": "positive", "message": "You pat your dog, and it leans into you with trust.", "happiness": 6},
          {"type": "negative", "message": "Your dog acknowledges the pet but doesn’t react much.", "happiness": 2},
          {"type": "hurt", "message": "You pat your dog, but in return, it accidentally steps on your foot!", "happiness": -3, "health": -1}
        ],
        "Curious": [
          {"type": "positive", "message": "You pat your dog, and it tilts its head, wondering what you want.", "happiness": 6},
          {"type": "negative", "message": "Your dog was too busy sniffing around to care about the pat.", "happiness": 1},
          {"type": "hurt", "message": "You pat your curious dog, but it gets too excited and trips over its own paws!", "happiness": -3, "health": -2}
        ],
        "Relaxed": [
          {"type": "positive", "message": "You pat your dog, and it lets out a satisfied sigh, closing its eyes in contentment.", "happiness": 7},
          {"type": "negative", "message": "Your dog was already relaxed and barely reacted to the pat.", "happiness": 2},
          {"type": "hurt", "message": "You patted your relaxed dog, but it rolled over too fast and fell off the couch!", "happiness": -3, "health": -2}
        ],
        "Embarrassed": [
          {"type": "positive", "message": "You pat your dog, and it sheepishly wags its tail, avoiding eye contact.", "happiness": 4},
          {"type": "negative", "message": "Your dog hesitates and looks away, seeming too shy for attention.", "happiness": -2},
          {"type": "hurt", "message": "You pat your dog, but it gets flustered and stumbles over its own paws!", "happiness": -4, "health": -2}
        ],
        "Nervous": [
          {"type": "positive", "message": "You pat your nervous dog, and it leans into you hesitantly.", "happiness": 5},
          {"type": "negative", "message": "Your dog flinches slightly but stays still.", "happiness": -1},
          {"type": "hurt", "message": "You pat your nervous dog, but it panics and knocks over its water bowl!", "happiness": -4, "health": -2}
        ],
        "Unmotivated": [
          {"type": "positive", "message": "You pat your dog, and it sighs, appreciating the small comfort.", "happiness": 4},
          {"type": "negative", "message": "Your dog barely reacts, too unmotivated to care.", "happiness": 0},
          {"type": "hurt", "message": "You pat your dog, but it flops down too fast and accidentally hurts itself.", "happiness": -3, "health": -2}
        ]
      },
      "Cat": {
        "Depressed": [
          {
            "type": "positive",
            "message": "You gently pet your cat. It meows softly, feeling a bit better.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "You try to pet your cat, but it doesn't purr, staying distant.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You stroke your cat, but it shies away and accidentally knocks over its water dish.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Frustrated": [
          {
            "type": "positive",
            "message": "You rub your cat behind the ears, and it eventually calms down.",
            "happiness": 6
          },
          {
            "type": "negative",
            "message": "Your cat flicks its tail and steps away from your hand.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "Your cat attempts to jump away but slides off the table, landing with a startled hiss.",
            "happiness": -3,
            "health": -1
          }
        ],
        "Happy": [
          {
            "type": "positive",
            "message": "You stroke your cat’s fur, and it purrs loudly, rubbing against you.",
            "happiness": 8
          },
          {
            "type": "negative",
            "message": "Your cat enjoys the pet but quickly leaps to the windowsill, ignoring you.",
            "happiness": 2
          },
          {
            "type": "hurt",
            "message": "Your cat tries to roll over in joy but tumbles off the couch.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Sad": [
          {
            "type": "positive",
            "message": "You pet your cat slowly, and it leans into your hand, seeking comfort.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "Your cat mews softly, still seeming down as you stroke it.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "Your cat tries to hide its face but bumps its head on the wall.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Angry": [
          {
            "type": "positive",
            "message": "You carefully approach your cat, stroking it until it lets out a small purr.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "Your cat hisses, stepping away from your reach, obviously annoyed.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "Your cat swipes at you, misses, and tumbles off the chair.",
            "happiness": -3,
            "health": -1
          }
        ],
        "Afraid": [
          {
            "type": "positive",
            "message": "You slowly pet your cat, and it calms down, curling up in your lap.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "Your cat cowers under the table, refusing your help.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "Your cat darts away in panic, colliding with a door.",
            "happiness": -3,
            "health": -1
          }
        ],
        "Excited": [
          {
            "type": "positive",
            "message": "You scratch your cat's back, and it dashes around playfully, meowing happily.",
            "happiness": 6
          },
          {
            "type": "negative",
            "message": "Your cat leaps around so much it barely notices your touch.",
            "happiness": 2
          },
          {
            "type": "hurt",
            "message": "Your cat jumps off a shelf in excitement and lands awkwardly on a pillow.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Lonely": [
          {
            "type": "positive",
            "message": "You pick up your cat, and it purrs softly, grateful for attention.",
            "happiness": 6
          },
          {
            "type": "negative",
            "message": "Your cat meows longingly, still craving more interaction.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "Your cat weaves around your legs too eagerly and nearly trips you both.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Playful": [
          {
            "type": "positive",
            "message": "You wiggle a toy, and your cat pounces eagerly, tail swishing with joy.",
            "happiness": 7
          },
          {
            "type": "negative",
            "message": "Your cat is so wound up it ignores your gentle pats, chasing shadows instead.",
            "happiness": 3
          },
          {
            "type": "hurt",
            "message": "Your cat tries to pounce on your hand and slips off the couch.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Annoyed": [
          {
            "type": "positive",
            "message": "You pat your cat gently, respecting its space. It tolerates your touch.",
            "happiness": 3
          },
          {
            "type": "negative",
            "message": "Your cat swishes its tail and walks away, unimpressed.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "Your cat whips around to swat you but overbalances and tumbles off the table!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Tired": [
          {
            "type": "positive",
            "message": "You stroke your sleepy cat, and it yawns, curling up contently.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "Your cat is too sleepy and barely responds to your touch.",
            "happiness": 0
          },
          {
            "type": "hurt",
            "message": "Your cat tries to shuffle away but flops on the floor, mewling softly.",
            "happiness": -1,
            "health": -1
          }
        ],
        "Bored": [
          {
            "type": "positive",
            "message": "You toss a toy mouse, and your cat chases it half-heartedly.",
            "happiness": 3
          },
          {
            "type": "negative",
            "message": "Your cat yawns, ignoring your attempts to play.",
            "happiness": 0
          },
          {
            "type": "hurt",
            "message": "Your cat knocks over a cup while searching for something fun to do.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Equal": [
          {
            "type": "positive",
            "message": "You pat your cat, sharing a brief moment of mutual respect.",
            "happiness": 3
          },
          {
            "type": "negative",
            "message": "Your cat gives you a neutral glance, neither upset nor pleased.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "Your cat steps on your foot in return, making you stumble!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Curious": [
          {
            "type": "positive",
            "message": "You pet your cat, and it sniffs around your hand, investigating curiously.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "Your cat is too busy exploring the room to notice your affection.",
            "happiness": 1
          },
          {
            "type": "hurt",
            "message": "Your cat gets startled by a new smell and jumps, hitting its head under a table.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Relaxed": [
          {
            "type": "positive",
            "message": "You rub your cat’s belly, and it stretches out in total contentment.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "Your cat was already dozing and barely notices your pat.",
            "happiness": 0
          },
          {
            "type": "hurt",
            "message": "Your cat rolls over too quickly and tumbles off its plush bed.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Embarrassed": [
          {
            "type": "positive",
            "message": "You stroke your cat softly, and it mews shyly, avoiding eye contact.",
            "happiness": 2
          },
          {
            "type": "negative",
            "message": "Your cat grooms itself in silence, ignoring your attempt at comfort.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "Your cat misjudges a jump, flailing and meowing in embarrassment.",
            "happiness": -3,
            "health": -1
          }
        ],
        "Nervous": [
          {
            "type": "positive",
            "message": "You pet your cat reassuringly, and it slowly settles in your lap.",
            "happiness": 3
          },
          {
            "type": "negative",
            "message": "Your cat backs away, ears flattened, uncertain about your approach.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "Your cat panics and takes off, crashing into a nearby stool.",
            "happiness": -3,
            "health": -1
          }
        ],
        "Unmotivated": [
          {
            "type": "positive",
            "message": "You give your cat a gentle pet, and it lazily rolls over for a tummy rub.",
            "happiness": 3
          },
          {
            "type": "negative",
            "message": "Your cat stays sprawled on the floor, barely acknowledging you.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "Your cat tries to move away but just flops into your leg, meowing softly.",
            "happiness": -2,
            "health": -1
          }
        ]
      },
      "Shrimp": {
        "Depressed": [
          {
            "type": "positive",
            "message": "You gently place your fingertip against the glass near the shrimp. Somehow, it seems to cheer up, swirling its tiny legs in a hopeful dance.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "You try to pat your shrimp through the tank, but it just floats listlessly, ignoring your attempt.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You tap the glass too hard, startling the shrimp into slamming its tail against the gravel in a sad little thud.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Frustrated": [
          {
            "type": "positive",
            "message": "You slowly move your finger in the water, giving a gentle 'pat' near the shrimp. It flicks its tail in annoyance at first, then calms down, as if realizing you mean no harm.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "You swirl the water gently to pat your shrimp, but it flicks away in frustration, unimpressed by your meddling.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "You attempt to stroke the shrimp with a small net, but it thrashes so wildly it bumps into the tank heater!",
            "happiness": -3,
            "health": -1
          }
        ],
        "Happy": [
          {
            "type": "positive",
            "message": "You try a playful 'shrimp pat' by wiggling your finger near the surface. Your shrimp zips around excitedly, as if returning the affection.",
            "happiness": 7
          },
          {
            "type": "negative",
            "message": "You tap the glass, but your shrimp is busy happily scuttling about, not paying much attention.",
            "happiness": 2
          },
          {
            "type": "hurt",
            "message": "Your shrimp is so thrilled that it flips out of the water, landing on the tank lid with a tiny thunk!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Sad": [
          {
            "type": "positive",
            "message": "You cup your hand gently above the water, creating a soft current near the shrimp. It drifts closer, as if finding comfort in your presence.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "You attempt to pat the shrimp, but it remains curled up in the corner, ignoring your comforting gesture.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You reach in too hastily, causing the shrimp to panic. It flicks into a rock and tumbles in a sad, clumsy spin.",
            "happiness": -3,
            "health": -1
          }
        ],
        "Angry": [
          {
            "type": "positive",
            "message": "You place a gentle finger in the water, and despite flaring its tiny pincers, the shrimp eventually allows a slight 'pat' on its shell.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "You try to pat your angry shrimp, but it darts away in a rage, stirring up gravel behind it.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "Your shrimp rushes forward as if to challenge your finger, then crashes into a driftwood piece, making a hollow thunk!",
            "happiness": -3,
            "health": -2
          }
        ],
        "Afraid": [
          {
            "type": "positive",
            "message": "You gently lower your finger near the shrimp, letting it feel the slight warmth. It quivers, then inches closer, calmer than before.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "Your shrimp recoils from your attempted pat, fleeing behind a plastic plant, trembling in watery terror.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "Your shrimp panics at your touch and barrels headfirst into the aquarium glass, leaving it momentarily stunned.",
            "happiness": -3,
            "health": -1
          }
        ],
        "Excited": [
          {
            "type": "positive",
            "message": "You swirl the water gently, and your shrimp zips back and forth, letting you give a quick pat on its shell as it swims by.",
            "happiness": 6
          },
          {
            "type": "negative",
            "message": "It's so hyper that your shrimp barely notices your pat, zooming around in joyous loops.",
            "happiness": 2
          },
          {
            "type": "hurt",
            "message": "The shrimp leaps in excitement, toppling a decorative castle and trapping itself momentarily!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Lonely": [
          {
            "type": "positive",
            "message": "You rest your hand in the tank. The shrimp slowly approaches and brushes against your finger as if seeking company.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "You try to pat your shrimp, but it hangs near the bottom, lonely but unwilling to approach you.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "In its desperate swim toward your hand, the shrimp bumps into the filter intake and gets momentarily stuck!",
            "happiness": -3,
            "health": -1
          }
        ],
        "Playful": [
          {
            "type": "positive",
            "message": "You gently tickle the water’s surface, and the shrimp does a little flip, as though returning a 'pat' from below.",
            "happiness": 6
          },
          {
            "type": "negative",
            "message": "You wiggle your finger near the shrimp, but it’s too busy chasing air bubbles to notice.",
            "happiness": 1
          },
          {
            "type": "hurt",
            "message": "Your shrimp zips around in play, then smacks right into your fingertip, flailing in confusion.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Annoyed": [
          {
            "type": "positive",
            "message": "You keep your finger still, letting the shrimp approach if it wants. It gives you one flick of the tail, like a half-hearted 'fine, I'll let you'.",
            "happiness": 3
          },
          {
            "type": "negative",
            "message": "You prod the tank glass to pat the shrimp. It flicks its tail and turns away with an annoyed swirl.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You attempt a quick pat, but the shrimp thrashes in irritation, nearly bashing itself into the gravel.",
            "happiness": -3,
            "health": -1
          }
        ],
        "Tired": [
          {
            "type": "positive",
            "message": "You slowly reach in and gently graze the shrimp’s back with a fingertip. It shudders, then rests on a pebble, half-asleep.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "You try to perk up your shrimp with a pat, but it’s too lethargic to care, drifting lazily.",
            "happiness": 0
          },
          {
            "type": "hurt",
            "message": "You disturb the shrimp’s nap with a pat, and it jumps so violently it flips onto its back in panic.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Bored": [
          {
            "type": "positive",
            "message": "You gently stir the water, giving a soft pat. The shrimp perks up, exploring your finger as if it's something new.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "Despite your pat, the shrimp remains idle, drifting around aimlessly.",
            "happiness": 1
          },
          {
            "type": "hurt",
            "message": "Trying to entertain it, you accidentally knock a toy, causing the shrimp to flee and tumble over a rock!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Equal": [
          {
            "type": "positive",
            "message": "You place your finger in the tank calmly, as if greeting a friend. The shrimp gives a mild flick, acknowledging you in mutual respect.",
            "happiness": 3
          },
          {
            "type": "negative",
            "message": "Your shrimp stares blankly through the glass at you—no hostility, no warmth—just a neutral vibe.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You attempt a respectful pat, but the shrimp misreads it and flips itself into the corner of the tank!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Curious": [
          {
            "type": "positive",
            "message": "You hold your hand steady in the tank, letting the shrimp approach. It gently taps your fingertip with its tiny legs, as if investigating.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "Your shrimp is too busy exploring a new rock to notice your pat attempt.",
            "happiness": 1
          },
          {
            "type": "hurt",
            "message": "The shrimp tries to examine your finger up close and panics, swimming head-first into the glass!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Relaxed": [
          {
            "type": "positive",
            "message": "You lightly stroke the water’s surface, and the shrimp remains calm, drifting in a slow, content circle.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "The shrimp is so at ease it barely notices your pat, continuing its mellow float.",
            "happiness": 0
          },
          {
            "type": "hurt",
            "message": "You gently poke at it, but it rolls too far in its relaxed state, toppling into the aquarium décor.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Embarrassed": [
          {
            "type": "positive",
            "message": "You pat softly above the shrimp, and it shrinks away shyly, then peeks out, as if unsure how to react.",
            "happiness": 2
          },
          {
            "type": "negative",
            "message": "You watch the shrimp’s every move, making it hide behind a fake coral, clearly flustered.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "The shrimp tries to flee your gaze, flipping sideways and bumping its shell on the tank lid!",
            "happiness": -3,
            "health": -1
          }
        ],
        "Nervous": [
          {
            "type": "positive",
            "message": "You move very slowly, offering a gentle pat on the water’s surface. The shrimp hesitantly approaches, quivering less than before.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "Your shrimp flips backward the moment you try to pat it, swirling away in alarm.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "A sudden noise startles both of you. The shrimp thrashes wildly and knocks into the heater!",
            "happiness": -4,
            "health": -2
          }
        ],
        "Unmotivated": [
          {
            "type": "positive",
            "message": "You attempt a light pat, creating ripples that gently carry the shrimp around, stirring it to move more.",
            "happiness": 3
          },
          {
            "type": "negative",
            "message": "Your shrimp remains slumped at the bottom, hardly twitching a leg despite your pat.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You try to rouse it with a flick of the water, but it lazily drifts into a rough piece of coral, scraping its shell.",
            "happiness": -2,
            "health": -1
          }
        ]
      },
      "Fish": {
        "Depressed": [
          {
            "type": "positive",
            "message": "You gently place your hand against the tank, and the fish slowly swims closer, seeming comforted by your presence.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "You tap the glass lightly, but the fish stays near the bottom, too down to react.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You knock the tank wall too hard, causing the fish to startle and bump into a decorative castle.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Frustrated": [
          {
            "type": "positive",
            "message": "You swirl the water gently at the surface, and the fish approaches, letting you give it a soft pat with your fingertip.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "You try to 'pet' the fish, but it flicks its tail, darting away, clearly unimpressed.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "You wave your hand too vigorously, stirring up a big current. The fish spins out, banging its fin on a rock!",
            "happiness": -3,
            "health": -1
          }
        ],
        "Happy": [
          {
            "type": "positive",
            "message": "You dip a finger in the water, and the fish swims up to nuzzle it, happily blowing bubbles.",
            "happiness": 7
          },
          {
            "type": "negative",
            "message": "You pat the tank, but your fish is already happily swimming in loops, barely noticing you.",
            "happiness": 2
          },
          {
            "type": "hurt",
            "message": "Your fish tries to show off, leaping at your finger, but it bonks its head on the tank lid!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Sad": [
          {
            "type": "positive",
            "message": "You move your hand slowly along the glass, and the fish follows, as if finding solace in your gentle motion.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "You attempt to pat your fish, but it remains in a corner, ignoring your presence.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "Your sudden tap on the tank startles the fish, causing it to slap its tail awkwardly on the gravel.",
            "happiness": -3,
            "health": -1
          }
        ],
        "Angry": [
          {
            "type": "positive",
            "message": "You gently wiggle your fingers in the water. The fish flares its fins at first but then calms, allowing a brief pat.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "You try to soothe your fish, but it swishes its tail furiously, stirring up a mini-sandstorm.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "Your fish rushes forward in anger, accidentally hitting the heater with a thud!",
            "happiness": -3,
            "health": -2
          }
        ],
        "Afraid": [
          {
            "type": "positive",
            "message": "You slowly lower your finger near the surface. After a moment of hesitation, the fish peeks out from behind a plant and approaches.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "You reach in too quickly, making the fish flee, trembling behind a rock.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "Startled by your sudden movement, the fish slams into the tank wall and floats in confusion.",
            "happiness": -3,
            "health": -1
          }
        ],
        "Excited": [
          {
            "type": "positive",
            "message": "You tap a gentle rhythm on the glass, and the fish darts around in glee, even allowing a quick pat when it passes by.",
            "happiness": 6
          },
          {
            "type": "negative",
            "message": "Your fish is too hyper, zooming circles around the tank, ignoring your pat attempts.",
            "happiness": 2
          },
          {
            "type": "hurt",
            "message": "In its excitement, the fish leaps out of the water, landing in a flopping panic before you can scoop it back in!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Lonely": [
          {
            "type": "positive",
            "message": "You rest your hand gently in the tank. The fish ventures over, brushing against your finger like it craves companionship.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "You try to pat the fish, but it stays near the corner, eyes wide, longing for another fish companion instead.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "Seeking attention, the fish swims full-speed at your hand, overshoots, and collides with a plastic treasure chest!",
            "happiness": -3,
            "health": -1
          }
        ],
        "Playful": [
          {
            "type": "positive",
            "message": "You swirl the water, creating tiny waves. The fish chases them happily, letting you pat it when it surfaces.",
            "happiness": 6
          },
          {
            "type": "negative",
            "message": "You try a playful pat, but the fish is too busy blowing bubbles at its reflection, ignoring you.",
            "happiness": 1
          },
          {
            "type": "hurt",
            "message": "In a burst of energy, the fish flips out of the water and crashes onto the tank’s edge, flopping in panic.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Annoyed": [
          {
            "type": "positive",
            "message": "You keep your finger still at the water’s surface, giving the fish space. Eventually, it tolerates a brief pat.",
            "happiness": 3
          },
          {
            "type": "negative",
            "message": "You tap the tank, but your fish flicks its tail, flipping around in annoyance, ignoring you.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You tap too much; the fish flares its fins and bounces off a rock in its agitation.",
            "happiness": -3,
            "health": -1
          }
        ],
        "Tired": [
          {
            "type": "positive",
            "message": "You softly swirl near the fish, and it gives a lethargic flap before leaning into the gentle pat.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "The fish is too drained to respond, barely flicking a fin at your attempt to pat it.",
            "happiness": 0
          },
          {
            "type": "hurt",
            "message": "Your fish tries to move away and accidentally drifts into the filter current, struggling for a moment.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Bored": [
          {
            "type": "positive",
            "message": "You trace a path on the glass, and the fish follows your finger with mild interest, letting you sneak in a tiny pat.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "You try to amuse the fish with gentle pats, but it just stares at you blankly, unimpressed.",
            "happiness": 1
          },
          {
            "type": "hurt",
            "message": "In an attempt to play, you create waves that knock the fish off balance, sending it spinning into the gravel.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Equal": [
          {
            "type": "positive",
            "message": "You place your hand in the water calmly, and the fish acknowledges your presence with a slow, dignified swim-by pat.",
            "happiness": 3
          },
          {
            "type": "negative",
            "message": "The fish glances at your hand, neither offended nor enthused, and continues its routine.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You attempt a mutual pat, but the fish misreads your move, scurries off, and bumps its head on the tank corner!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Curious": [
          {
            "type": "positive",
            "message": "You hold your hand still, letting the fish investigate. It nibbles at your fingertips in a playful, curious pat-back.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "The fish is too distracted exploring the gravel for morsels to respond to your pat.",
            "happiness": 1
          },
          {
            "type": "hurt",
            "message": "The fish tries to investigate your finger from below and slams into the tank thermometer instead.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Relaxed": [
          {
            "type": "positive",
            "message": "You move your hand in slow circles, and the fish floats serenely, letting you lightly pat its dorsal fin.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "Your fish is so mellow it just drifts, ignoring even your gentle attempts at contact.",
            "happiness": 0
          },
          {
            "type": "hurt",
            "message": "Your fish lazily rolls too far in its relaxed state, flipping onto its side against the glass!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Embarrassed": [
          {
            "type": "positive",
            "message": "You gently slide your finger along the tank, and the fish awkwardly nudges it, as if shy but appreciative.",
            "happiness": 2
          },
          {
            "type": "negative",
            "message": "Your fish avoids direct contact, turning away as if it doesn’t want to be seen during a clumsy moment.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "The fish tries to hide behind a plant but bumps into the glass, thrashing in a flustered panic.",
            "happiness": -3,
            "health": -1
          }
        ],
        "Nervous": [
          {
            "type": "positive",
            "message": "You remain very still, letting the fish cautiously approach. It lightly brushes your fingertip, less jittery now.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "Any small movement spooks the fish, which zips around wildly, too nervous to accept a pat.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "A sudden reflection on the tank sets it off, and the fish collides with the filter, rattling it!",
            "happiness": -4,
            "health": -2
          }
        ],
        "Unmotivated": [
          {
            "type": "positive",
            "message": "You create a gentle current, giving the fish a light swirl-pat that nudges it to swim a bit more.",
            "happiness": 3
          },
          {
            "type": "negative",
            "message": "Your fish hardly responds to your pat attempt, drifting languidly at the bottom.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You try to liven it up by splashing the surface, but the fish floats into a rock, scraping its fin.",
            "happiness": -2,
            "health": -1
          }
        ]
      },  
      "Roach": {
        "Depressed": [
          {
            "type": "positive",
            "message": "You gently lower your hand near the roach, and it slowly crawls onto your palm, seeming a bit uplifted by the attention.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "You try to pat the roach, but it doesn’t react, antennae drooping as it remains motionless.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You tap too close, startling the roach, and it scuttles right into a crack in the floor.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Frustrated": [
          {
            "type": "positive",
            "message": "You gently stroke the roach’s back with a fingertip. It twitches at first, then settles as if accepting your attempt to calm it.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "Your roach skitters in circles, ignoring your pat and flicking its antennae in annoyance.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "In a fit of frustration, the roach darts straight into the wall, bouncing back onto its back with a confused hiss.",
            "happiness": -3,
            "health": -1
          }
        ],
        "Happy": [
          {
            "type": "positive",
            "message": "You softly poke the roach’s shell, and it scuttles around your hand in a little dance of joy.",
            "happiness": 6
          },
          {
            "type": "negative",
            "message": "You pat the roach, but it’s already happy, buzzing its wings and running in circles, barely noticing you.",
            "happiness": 2
          },
          {
            "type": "hurt",
            "message": "Your roach tries to climb your arm too exuberantly, slips, and tumbles to the floor!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Sad": [
          {
            "type": "positive",
            "message": "You cup the roach gently in your hands, letting it rest in darkness. It clicks its mandibles softly, seeming comforted.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "You place your hand near it, but the roach just hides under a leaf, antennae drooping in gloom.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "Your roach tries to crawl away but slips off an edge and plops onto its back, flailing legs in the air.",
            "happiness": -3,
            "health": -1
          }
        ],
        "Angry": [
          {
            "type": "positive",
            "message": "You approach slowly and give a tiny pat. The roach stops hissing and folds its wings, anger subsiding.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "You try to calm it with a pat, but it flares its wings, making an angry skittering noise and darting away.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "Your roach charges forward in anger, stubbing its antennae on your finger, squeaking in insect fury.",
            "happiness": -3,
            "health": -2
          }
        ],
        "Afraid": [
          {
            "type": "positive",
            "message": "You hold your hand out steadily, letting the roach climb on. It trembles less, antennae flicking nervously but calmer.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "Any sudden movement, and the roach scurries under the nearest shadow, too scared for pats.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "Your roach panics at your touch, flips over a pebble, and knocks itself sideways in its desperate escape.",
            "happiness": -3,
            "health": -1
          }
        ],
        "Excited": [
          {
            "type": "positive",
            "message": "You wiggle your finger in front of the roach, and it scuttles around in excitement, letting you pat its shell mid-scurry.",
            "happiness": 6
          },
          {
            "type": "negative",
            "message": "Your roach is so hyper it dashes under every object, ignoring your attempts to pat it.",
            "happiness": 2
          },
          {
            "type": "hurt",
            "message": "The roach tries to climb a wall at high speed, loses its footing, and tumbles back with a startled hiss.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Lonely": [
          {
            "type": "positive",
            "message": "You offer your open palm, and the roach crawls on, gently tapping your skin with its antennae like it appreciates the company.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "You try to pat the roach, but it remains in a dark corner, longing for a fellow insect friend.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "Desperate for companionship, the roach tries to climb your finger too fast and slips onto a rough surface, scratching its shell.",
            "happiness": -3,
            "health": -1
          }
        ],
        "Playful": [
          {
            "type": "positive",
            "message": "You pat the roach, and it skitters around your hand, as if playing a tiny game of chase.",
            "happiness": 6
          },
          {
            "type": "negative",
            "message": "Your roach is so busy exploring every crack and crevice that it barely registers your pat.",
            "happiness": 1
          },
          {
            "type": "hurt",
            "message": "It tries to play hide-and-seek by darting under your palm, but it misjudges and flips itself over in a comedic tumble.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Annoyed": [
          {
            "type": "positive",
            "message": "You barely touch the roach’s carapace. It hisses softly but tolerates you, scuttling in a circle.",
            "happiness": 3
          },
          {
            "type": "negative",
            "message": "You press a pat too eagerly, and the roach darts off, antennae waving in displeasure.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You corner the roach while patting it, and it accidentally runs straight into your hand, falling over.",
            "happiness": -3,
            "health": -1
          }
        ],
        "Tired": [
          {
            "type": "positive",
            "message": "You give a gentle pet along its back, and it just sits there, half-asleep, legs barely moving.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "You poke the roach, but it's too tired to scuttle away, offering no reaction at all.",
            "happiness": 0
          },
          {
            "type": "hurt",
            "message": "It tries to move from your pat but just flops onto its side, too drained to stay upright.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Bored": [
          {
            "type": "positive",
            "message": "You drum your fingers gently around the roach, and it perks up, wandering between them like an obstacle course.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "Your roach stays still, uninterested in your pat, occasionally flicking an antenna with boredom.",
            "happiness": 1
          },
          {
            "type": "hurt",
            "message": "You try to tease it into moving, but it darts recklessly and bumps against a chair leg!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Equal": [
          {
            "type": "positive",
            "message": "You place your hand beside the roach, letting it decide if it wants contact. It touches your hand briefly in a gesture of roach-human respect.",
            "happiness": 3
          },
          {
            "type": "negative",
            "message": "The roach acknowledges you with a twitch of its antenna but doesn’t approach, seemingly neutral.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You attempt a respectful pat, but the roach scuttles at the wrong moment, colliding with your finger and toppling sideways.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Curious": [
          {
            "type": "positive",
            "message": "You let the roach investigate your hand. It crawls around, exploring every crease, and allows a gentle pat in return.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "Your roach is too busy sniffing out crumbs to notice your pat attempt.",
            "happiness": 1
          },
          {
            "type": "hurt",
            "message": "While investigating your fingertip, the roach slips and tumbles off the edge of the table!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Relaxed": [
          {
            "type": "positive",
            "message": "You set your hand down flat, and the roach sits calmly on top, letting you lightly touch its shell.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "The roach is already so relaxed, it barely notices your pat, continuing to lounge in a warm spot.",
            "happiness": 0
          },
          {
            "type": "hurt",
            "message": "You shift your hand too fast, and the roach lazily rolls off, landing with a startled squeak.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Embarrassed": [
          {
            "type": "positive",
            "message": "You pat the roach gently. It shuffles its feet awkwardly but seems grateful for the attention.",
            "happiness": 2
          },
          {
            "type": "negative",
            "message": "The roach hides under a leaf, antennae trembling, too shy to accept your pat.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "The roach tries to skitter away, slips on a smooth surface, and lands unceremoniously on its back!",
            "happiness": -3,
            "health": -1
          }
        ],
        "Nervous": [
          {
            "type": "positive",
            "message": "You stay still, letting the roach inch closer on its own. Once it settles, you give it the softest pat, easing its tension.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "Any attempt at contact makes the roach jitter and dart away, too nervous to handle a pat.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "A sudden noise in the room spooks your roach. It dashes in panic, crashing into a table leg!",
            "happiness": -4,
            "health": -2
          }
        ],
        "Unmotivated": [
          {
            "type": "positive",
            "message": "You gently stroke the roach’s shell, encouraging it to move. It drags itself forward, as if begrudgingly motivated.",
            "happiness": 3
          },
          {
            "type": "negative",
            "message": "Your roach hardly budges, ignoring your pat as it remains slumped against a wall.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You try to nudge it to move, but it lazily flops over, smacking its antenna on a pebble.",
            "happiness": -2,
            "health": -1
          }
        ]
      }, 
      "Mouse": {
        "Depressed": [
          {
            "type": "positive",
            "message": "You quietly place your hand nearby, and the mouse nudges your finger, showing a small spark of hope.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "You try to pat the mouse, but it barely reacts, whiskers drooping as if too sad to care.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You reach over it too quickly, causing the mouse to scramble and tumble off its tiny ledge!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Frustrated": [
          {
            "type": "positive",
            "message": "You gently rub the mouse’s head, and after a moment of twitchy whiskers, it calms down a little.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "Your mouse squeaks and scurries out of reach, thumping its tail in frustration at your attempt.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "In its frustration, the mouse tries to dash away, slips on a pile of bedding, and rolls onto its back!",
            "happiness": -3,
            "health": -1
          }
        ],
        "Happy": [
          {
            "type": "positive",
            "message": "You pat the mouse’s soft fur, and it responds with an adorable squeak, scurrying in joyful circles around your hand.",
            "happiness": 8
          },
          {
            "type": "negative",
            "message": "You try to pat the mouse, but it's already so busy enjoying its day, sniffing around and ignoring you.",
            "happiness": 2
          },
          {
            "type": "hurt",
            "message": "Your mouse gets overexcited and leaps up to greet you, accidentally bumping its tiny head on your thumb!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Sad": [
          {
            "type": "positive",
            "message": "You gently stroke the mouse’s back, and it huddles closer, finding a bit of comfort in your touch.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "You offer a pat, but the mouse remains curled up, letting out a small squeak of sorrow.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "Your mouse tries to move away but stumbles, landing face-first in its bedding, squeaking in surprise!",
            "happiness": -3,
            "health": -1
          }
        ],
        "Angry": [
          {
            "type": "positive",
            "message": "You slowly place your hand in front of the mouse, letting it vent its tiny squeaks before it grudgingly accepts a pat.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "The mouse squeals angrily and snaps its teeth at your hand, rejecting the pat.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "It charges your hand in a show of bravado, slips, and lands in its water dish, sputtering and squeaking!",
            "happiness": -3,
            "health": -2
          }
        ],
        "Afraid": [
          {
            "type": "positive",
            "message": "You move slowly and speak softly, placing one finger near the mouse. It trembles but leans in, accepting the pat.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "You approach too quickly, sending the mouse darting into a corner, trembling in fear.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "Spooked by your hand, the mouse tries to leap away but collides with the cage bars, dazed.",
            "happiness": -3,
            "health": -1
          }
        ],
        "Excited": [
          {
            "type": "positive",
            "message": "You pat the mouse’s head, and it scampers around in happy circles, squeaking in delight.",
            "happiness": 7
          },
          {
            "type": "negative",
            "message": "Your mouse is so energetic that it barely notices your pat, bouncing off to investigate new smells.",
            "happiness": 2
          },
          {
            "type": "hurt",
            "message": "Mid-leap, the mouse tries to jump into your hand but overshoots, toppling into its food bowl!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Lonely": [
          {
            "type": "positive",
            "message": "You reach into the cage and lightly stroke the mouse’s back, giving it the attention it craves.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "You try to pat the mouse, but it squeaks pitifully and stays in a corner, clearly wanting a fellow mouse instead.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "It runs to greet you too quickly, slips on sawdust, and crashes into the water bottle!",
            "happiness": -3,
            "health": -1
          }
        ],
        "Playful": [
          {
            "type": "positive",
            "message": "You tap your fingers on the floor, and the mouse hops around, letting you sneak in a quick pat mid-bounce.",
            "happiness": 6
          },
          {
            "type": "negative",
            "message": "It’s so busy scampering around in play mode that your gentle pats go unnoticed.",
            "happiness": 1
          },
          {
            "type": "hurt",
            "message": "The mouse tries to chase your finger but accidentally runs into a small toy, tumbling over with a surprised squeak.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Annoyed": [
          {
            "type": "positive",
            "message": "You barely touch the mouse’s fur, respecting its space. It huffs but allows a brief pat.",
            "happiness": 3
          },
          {
            "type": "negative",
            "message": "You press your finger on its back, and the mouse squeaks loudly, stomping its tiny feet in irritation.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "Your mouse twitches in frustration at your pat, jerks away, and trips over its own tail!",
            "happiness": -3,
            "health": -1
          }
        ],
        "Tired": [
          {
            "type": "positive",
            "message": "You softly brush the mouse’s fur as it dozes. It twitches its whiskers in a half-asleep response.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "Your mouse is too worn out and barely acknowledges your pat, just letting out a tiny yawn.",
            "happiness": 0
          },
          {
            "type": "hurt",
            "message": "Your hand nudges it unexpectedly, and the sleepy mouse topples over onto its side with a squeak.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Bored": [
          {
            "type": "positive",
            "message": "You drum your fingers in front of the mouse, and it perks up, letting you pat its head while it investigates.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "You try to pat the mouse, but it remains listless, sniffing around without interest.",
            "happiness": 1
          },
          {
            "type": "hurt",
            "message": "You attempt to liven things up with a quick pat, but the mouse startles and smacks into its exercise wheel!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Equal": [
          {
            "type": "positive",
            "message": "You place your hand at the same level as the mouse. It scampers onto it, giving a respectful nod of whiskers.",
            "happiness": 3
          },
          {
            "type": "negative",
            "message": "Your mouse regards you with a neutral whisker-twitch and continues sniffing the cage floor, unimpressed.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You try to pat it respectfully, but the mouse steps on your finger at the same time, losing balance and flopping over!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Curious": [
          {
            "type": "positive",
            "message": "You let the mouse sniff your hand first. It then allows you to pat its ears, whiskers twitching in fascination.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "It’s so busy exploring new corners of the cage that your pat goes unnoticed.",
            "happiness": 1
          },
          {
            "type": "hurt",
            "message": "The mouse climbs your hand to investigate a smell and topples off the other side, squeaking in shock!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Relaxed": [
          {
            "type": "positive",
            "message": "You gently stroke the mouse’s fur while it lounges, eyes half-closed. It squeaks softly in contentment.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "Your mouse is so relaxed it barely moves an ear in response, continuing its snoozy sprawl.",
            "happiness": 0
          },
          {
            "type": "hurt",
            "message": "You pat too eagerly, and the mouse rolls over in surprise, bumping its nose on the cage bars!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Embarrassed": [
          {
            "type": "positive",
            "message": "You coax the mouse gently, and it peeks out from behind its paws, accepting a soft pat with a sheepish squeak.",
            "happiness": 2
          },
          {
            "type": "negative",
            "message": "Your mouse tries to hide its face, whiskers trembling, too flustered to let you pat it.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "The mouse attempts to hide behind a toy but trips over it, squeaking in mortified surprise.",
            "happiness": -3,
            "health": -1
          }
        ],
        "Nervous": [
          {
            "type": "positive",
            "message": "You place your hand calmly in the cage. After some sniffing, the mouse creeps closer, letting you stroke its back.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "Your mouse scurries away, squeaking anxiously at any movement, too on edge for a pat.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "Spooked by a sudden sound, the mouse bolts and smacks into its water dish in panic!",
            "happiness": -4,
            "health": -2
          }
        ],
        "Unmotivated": [
          {
            "type": "positive",
            "message": "You offer a gentle scratch behind its ears. It slowly stands, as if gathering the will to move about.",
            "happiness": 3
          },
          {
            "type": "negative",
            "message": "No amount of tapping or patting rouses the mouse—it just sits, whiskers drooping, ignoring your effort.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You try to nudge it into action with a pat, but it flops over, bumping its head on the cage floor.",
            "happiness": -2,
            "health": -1
          }
        ]
      },  
      "Raccoon": {
        "Depressed": [
          {
            "type": "positive",
            "message": "You gently stroke the raccoon’s fuzzy back while it sifts halfheartedly through some trash, offering a small flick of its ringed tail in appreciation.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "You try to pat the raccoon, but it just stares into the distance, paws limp on an old soda can.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You move to pat it too quickly, startling the raccoon into toppling a trash bin onto itself.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Frustrated": [
          {
            "type": "positive",
            "message": "You sit beside the raccoon, lightly patting its shoulder as it growls at a locked garbage can. It huffs but calms under your gentle touch.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "You offer a consoling pat, but the raccoon flings a banana peel at your hand, still annoyed at its rummaging failures.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "You pat the raccoon mid-tantrum, and it thrashes, sending trash flying. It slips on a greasy box and tumbles over!",
            "happiness": -3,
            "health": -1
          }
        ],
        "Happy": [
          {
            "type": "positive",
            "message": "You pat the raccoon’s head, and it chatters excitedly, hugging an empty chip bag like a prized treasure.",
            "happiness": 7
          },
          {
            "type": "negative",
            "message": "You try to pat the raccoon, but it's busy gleefully rummaging through trash, barely noticing your attempt.",
            "happiness": 2
          },
          {
            "type": "hurt",
            "message": "Overjoyed, the raccoon leaps up at your pat, loses balance, and crashes into an overturned bucket!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Sad": [
          {
            "type": "positive",
            "message": "You gently rub the raccoon’s ears, and it gives a lonely chitter, leaning into you for a moment of comfort.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "You try to pat the raccoon, but it stays hunched over a discarded pizza box, looking downcast.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "Your hand startles it mid-sulk, and it yelps, stumbling back into a stack of tin cans.",
            "happiness": -3,
            "health": -1
          }
        ],
        "Angry": [
          {
            "type": "positive",
            "message": "You slowly approach the raccoon, placing a gentle pat on its scruff as it hisses at a locked dumpster. Eventually, it settles down.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "Your raccoon bares its teeth, refusing your attempted pat, too busy clawing at an unopened trash bin.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "In a rage, the raccoon spins to bite your hand but bites a crumpled soda can instead, yelping in shock!",
            "happiness": -3,
            "health": -2
          }
        ],
        "Afraid": [
          {
            "type": "positive",
            "message": "You lower your hand quietly, letting the raccoon sniff your fingers before giving it a slow pat. It trembles less, feeling safer.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "Your sudden movement spooks it. The raccoon bolts behind a trash bin, peeking out with wide eyes.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "Panicked by your approach, the raccoon scurries away, slips on a greasy wrapper, and faceplants into the sidewalk!",
            "happiness": -3,
            "health": -1
          }
        ],
        "Excited": [
          {
            "type": "positive",
            "message": "You pat the raccoon’s back, and it chatters wildly, scurrying around a garbage pile, knocking lids off in glee.",
            "happiness": 6
          },
          {
            "type": "negative",
            "message": "It’s so pumped up that it dashes back and forth, ignoring your pat attempts entirely.",
            "happiness": 2
          },
          {
            "type": "hurt",
            "message": "Overexcited, the raccoon tries to show off by climbing a dumpster, loses grip, and tumbles onto a pile of cardboard!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Lonely": [
          {
            "type": "positive",
            "message": "You sit next to the raccoon, lightly patting its side. It chatters softly, scooting closer for company.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "You offer a pat, but it just whimpers softly, rummaging aimlessly through trash as though missing a fellow raccoon.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "Desperate for companionship, the raccoon climbs into your lap too eagerly and accidentally claws your leg, then falls off!",
            "happiness": -3,
            "health": -1
          }
        ],
        "Playful": [
          {
            "type": "positive",
            "message": "You pat the raccoon, and it responds by nudging a plastic cup at you, wanting a playful tug-of-war.",
            "happiness": 6
          },
          {
            "type": "negative",
            "message": "The raccoon is so busy batting cans around that it hardly notices your pat, rummaging happily on its own.",
            "happiness": 1
          },
          {
            "type": "hurt",
            "message": "Your attempt to join the fun goes awry when it leaps after your hand, misjudges the jump, and lands face-first in a paper bag.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Annoyed": [
          {
            "type": "positive",
            "message": "You barely place your hand on its fur, respecting its mood. It sighs but tolerates your light pat.",
            "happiness": 3
          },
          {
            "type": "negative",
            "message": "Your raccoon huffs and turns its back to your pat, rummaging noisily through trash to ignore you.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You pat too insistently, and the raccoon spins around, tangling itself in plastic bags before tripping over a tin can!",
            "happiness": -3,
            "health": -1
          }
        ],
        "Tired": [
          {
            "type": "positive",
            "message": "You spot the raccoon dozing in a pile of newspapers. A gentle pat makes it chitter softly, half-asleep and too lazy to resist.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "Your raccoon is too drained to respond, lying sprawled among stale food wrappers, ignoring your pat.",
            "happiness": 0
          },
          {
            "type": "hurt",
            "message": "You disturb its nap with a pat, and it jolts awake, rolling off a stack of magazines with a sleepy yelp!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Bored": [
          {
            "type": "positive",
            "message": "You drum your fingers, inviting the raccoon to investigate. It sniffs around, letting you sneak in a quick pat to cure its boredom.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "No matter your pat, the raccoon remains bored, lazily flicking through junk, uninterested in your attention.",
            "happiness": 1
          },
          {
            "type": "hurt",
            "message": "In an attempt to amuse it, you rustle a plastic bag, but the raccoon jumps in surprise and bashes its head on the dumpster lid!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Equal": [
          {
            "type": "positive",
            "message": "You sit down at the raccoon’s level, offering a respectful pat. It nods in trashy solidarity, sharing a brief moment of mutual understanding.",
            "happiness": 3
          },
          {
            "type": "negative",
            "message": "You show your hand politely, but the raccoon merely glances at you, continuing its rummaging without malice or excitement.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You attempt a balanced pat, but the raccoon shifts unexpectedly, tangling itself in old netting and flopping over!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Curious": [
          {
            "type": "positive",
            "message": "You hold out your hand, and the raccoon sniffs each finger curiously. It then allows a slight pat on its ringed tail.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "It’s too busy exploring a new stash of trash, ignoring your pat as it unearths treasure: a half-eaten donut!",
            "happiness": 1
          },
          {
            "type": "hurt",
            "message": "The raccoon tries to investigate your pockets, loses balance, and falls into a tipped-over garbage bin!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Relaxed": [
          {
            "type": "positive",
            "message": "You find the raccoon lounging in a comfy nest of newspapers. A gentle pat gets a soft chitter of contentment.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "The raccoon is so calm it barely acknowledges your pat, continuing to sprawl among discarded wrapping papers.",
            "happiness": 0
          },
          {
            "type": "hurt",
            "message": "You pat it a bit too enthusiastically, and the raccoon rolls over in surprise, tumbling off its cozy trash pile!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Embarrassed": [
          {
            "type": "positive",
            "message": "You pat the raccoon gently, and it hides its face behind its paws, flustered but somewhat appreciative.",
            "happiness": 2
          },
          {
            "type": "negative",
            "message": "It seems too shy to accept your pat, turning away and pretending to rummage with forced nonchalance.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "Trying to act cool, the raccoon attempts a fancy climb but slips, toppling headfirst into a trash lid with a loud clang!",
            "happiness": -3,
            "health": -1
          }
        ],
        "Nervous": [
          {
            "type": "positive",
            "message": "You stay still, letting the raccoon approach on its own. Eventually, it sniffs you and allows a quick pat before retreating.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "The raccoon jitters at every noise, flinching away each time you try to pat it.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "A sudden crash spooks the raccoon, sending it fleeing into a pile of glass bottles, clinking and crashing!",
            "happiness": -4,
            "health": -2
          }
        ],
        "Unmotivated": [
          {
            "type": "positive",
            "message": "You pat the raccoon, encouraging it to rummage. It sluggishly sifts through trash, seeming a bit more engaged.",
            "happiness": 3
          },
          {
            "type": "negative",
            "message": "Your raccoon hardly stirs despite your pat, lacking the energy even to rummage properly.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You nudge it to move, but it halfheartedly slips on a wet cardboard, faceplanting into scraps of takeout!",
            "happiness": -2,
            "health": -1
          }
        ]
      },  
      "Snail": {
        "Depressed": [
          {
            "type": "positive",
            "message": "You lightly drizzle water around the snail and give its shell a gentle pat. It peeks out just a bit, as if feeling slightly better.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "You tap on its shell, but the snail remains retracted, unmoving, too down to respond.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You pat the shell too firmly, causing the snail to jolt inside and bump its tender body against the shell walls.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Frustrated": [
          {
            "type": "positive",
            "message": "You pour a light mist of water and pat the snail’s shell. It hesitates, then slowly extends its antennae, seeming calmer.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "You attempt to stroke its shell, but it pulls inside, leaving a trail of slime as if annoyed by your interruption.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "Your snail tries to scoot away quickly but flips sideways on a slippery rock, landing with a dull thud!",
            "happiness": -3,
            "health": -1
          }
        ],
        "Happy": [
          {
            "type": "positive",
            "message": "You pat the snail’s shell with a gentle finger. It extends its eye-stalks proudly, gliding in a cheerful swirl.",
            "happiness": 7
          },
          {
            "type": "negative",
            "message": "You try to pat it, but the snail is happily inching around, ignoring your attempts as it explores a dew-covered leaf.",
            "happiness": 2
          },
          {
            "type": "hurt",
            "message": "Excitedly wiggling its tentacles, the snail misjudges the edge and slips off the terrarium’s log!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Sad": [
          {
            "type": "positive",
            "message": "You gently rub water across its shell. It peeks out, tentacles drooping, but nudges your finger as if seeking comfort.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "You pat near the snail, but it stays inside, leaving only a sad little trail of slime behind.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "Startled by your hand, it retracts too fast and bangs its shell on a rock, letting out a silent snail sigh.",
            "happiness": -3,
            "health": -1
          }
        ],
        "Angry": [
          {
            "type": "positive",
            "message": "You mist the snail’s enclosure and tap softly on its shell. It quivers in annoyance but eventually stops retracting.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "Your snail flares its eye-stalks at you (as much as a snail can), refusing your pat by oozing away in tiny, angry increments.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "It attempts to jerk away, slides off a leaf, and rolls onto its shell with a frustrated squelch!",
            "happiness": -3,
            "health": -2
          }
        ],
        "Afraid": [
          {
            "type": "positive",
            "message": "You hold your palm near the snail. After a tense moment, it cautiously extends one tentacle and inches onto your hand.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "Any movement you make sends the snail retreating inside its shell, trembling under a film of slime.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "Your snail panics, flailing its antennae, and slips off the terrarium wall in a slow-motion tumble!",
            "happiness": -3,
            "health": -1
          }
        ],
        "Excited": [
          {
            "type": "positive",
            "message": "You pat the snail’s shell, and it zooms (relatively speaking) around the terrarium, eye-stalks fully extended!",
            "happiness": 6
          },
          {
            "type": "negative",
            "message": "Your snail is so 'fast' right now that it barely acknowledges your pat, leaving a shining trail of slime as it goes.",
            "happiness": 2
          },
          {
            "type": "hurt",
            "message": "In its excitement, the snail climbs the terrarium wall at an odd angle and slips, sliding down with a squeaky scratch!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Lonely": [
          {
            "type": "positive",
            "message": "You rest your hand in its path, letting the snail explore your skin. It softly bumps your finger, as if relieved to have contact.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "You pat the snail’s shell, but it remains withdrawn, as if longing for another snail friend to slime around with.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "Hoping for companionship, the snail tries to climb onto your hand too eagerly, sliding off and landing on a pebbly surface!",
            "happiness": -3,
            "health": -1
          }
        ],
        "Playful": [
          {
            "type": "positive",
            "message": "You tap gently on the terrarium floor, and the snail inches over, letting you pat its shell as it wriggles its tentacles happily.",
            "happiness": 6
          },
          {
            "type": "negative",
            "message": "It’s feeling playful but in its own snail-paced way, ignoring your pat to swirl around a leaf instead.",
            "happiness": 1
          },
          {
            "type": "hurt",
            "message": "Your snail tries to chase your finger—well, snail-speed chase—and tumbles off a small rock in the process!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Annoyed": [
          {
            "type": "positive",
            "message": "You barely touch its shell, giving it space. The snail flicks an antenna, irritated, but tolerates your presence.",
            "happiness": 3
          },
          {
            "type": "negative",
            "message": "You pat the snail more firmly, and it retracts its eye-stalks in protest, leaving a trail of miffed slime.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You corner the snail for a pat, and it tries to retreat quickly, rolling sideways off the moss patch!",
            "happiness": -3,
            "health": -1
          }
        ],
        "Tired": [
          {
            "type": "positive",
            "message": "You lightly sprinkle water on the snail’s shell, and it gives a slow blink, too tired to resist your gentle pat.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "Your snail is too exhausted to emerge, ignoring your pat as it rests, half-in and half-out of its shell.",
            "happiness": 0
          },
          {
            "type": "hurt",
            "message": "It tries to shrink away from your pat but collapses onto the terrarium floor with a dull thud, too drained to keep moving.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Bored": [
          {
            "type": "positive",
            "message": "You rearrange a few leaves and give the snail a light pat. It extends its antennae, exploring the new layout with mild interest.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "You try to poke it into action, but the snail just sits there, seemingly unmotivated and unimpressed.",
            "happiness": 1
          },
          {
            "type": "hurt",
            "message": "In an attempt to amuse it, you flick water droplets around, and the snail slips on one, sliding headfirst into a rock!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Equal": [
          {
            "type": "positive",
            "message": "You place your hand flat, letting the snail approach on its own terms. It slowly glides onto your palm, accepting a polite pat.",
            "happiness": 3
          },
          {
            "type": "negative",
            "message": "The snail regards your hand neutrally, continuing its slow slime trail without hostility or enthusiasm.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You try a respectful pat, but the snail squirms, losing suction and sliding off your palm with a soft thunk!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Curious": [
          {
            "type": "positive",
            "message": "You let the snail investigate your finger first. It touches your skin with its antennae before allowing a gentle shell pat.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "It’s too busy exploring a tiny crevice in the terrarium to notice your pat attempt.",
            "happiness": 1
          },
          {
            "type": "hurt",
            "message": "While examining your hand, the snail creeps too far off the terrarium edge and plops onto a damp sponge!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Relaxed": [
          {
            "type": "positive",
            "message": "You lightly brush the snail’s shell, and it continues its leisurely crawl, tentacles at ease in a sign of calm.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "Your snail is already so mellow it hardly reacts, continuing its slow, content glide along the moss.",
            "happiness": 0
          },
          {
            "type": "hurt",
            "message": "You pat a bit too vigorously, and the snail lurches forward, nearly flipping onto its back in surprise!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Embarrassed": [
          {
            "type": "positive",
            "message": "You pat the snail softly, and it retreats shyly, then peeks out again as if it’s uncertain about being watched.",
            "happiness": 2
          },
          {
            "type": "negative",
            "message": "You stare too intently at the snail. It blushes in snail-fashion, receding into its shell and refusing your pat.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "Flustered, the snail tries to scoot away quickly, slips on its own slime, and bumps its shell on a pebble!",
            "happiness": -3,
            "health": -1
          }
        ],
        "Nervous": [
          {
            "type": "positive",
            "message": "You keep still, letting the snail extend its antennae to verify safety. Slowly, it tolerates a gentle tap on its shell.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "Your snail retracts at the slightest motion, refusing all contact, its antennae trembling with worry.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "Startled by a sudden movement, it jerks backward, tipping its entire shell off a small ledge in the terrarium!",
            "happiness": -4,
            "health": -2
          }
        ],
        "Unmotivated": [
          {
            "type": "positive",
            "message": "You gently tilt the snail’s shell, adding a slight pat. It sluggishly stirs, coaxed into moving a few steps.",
            "happiness": 3
          },
          {
            "type": "negative",
            "message": "No matter how you pat, the snail stays in place, antennae drooping as if it can’t be bothered.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You nudge it for motivation, but it flops sideways, shell clacking on a rock as it slides inertly.",
            "happiness": -2,
            "health": -1
          }
        ]
      },
      "Worm": {
        "Depressed": [
          {
            "type": "positive",
            "message": "You gently press your fingertip against the soil near the worm. It emerges slightly, as if sensing a bit of warmth and solace.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "You attempt to pat the worm, but it remains coiled in the dirt, barely reacting.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You tap too forcefully, causing a small clod of soil to collapse onto the worm, burying it momentarily!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Frustrated": [
          {
            "type": "positive",
            "message": "You carefully scoop up the worm and let it wriggle on your palm, offering a slow, calming pat. Its frantic movements ease up a bit.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "You try to pat the worm gently, but it twists in agitation, slipping through your fingers into the soil again.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "The worm flails in frustration when you pat it, tangling itself in a root and thrashing so hard it tears the root free!",
            "happiness": -3,
            "health": -1
          }
        ],
        "Happy": [
          {
            "type": "positive",
            "message": "You pat the worm’s soft segments gently, and it wriggles playfully, seeming content in its squishy way.",
            "happiness": 7
          },
          {
            "type": "negative",
            "message": "Your worm is happily tunneling through moist soil and barely notices your pat, continuing its rhythmic wiggle.",
            "happiness": 2
          },
          {
            "type": "hurt",
            "message": "Overexcited by your presence, the worm surfaces too quickly and tumbles off the edge of its container!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Sad": [
          {
            "type": "positive",
            "message": "You moisten the soil and pat the worm’s body gently, as if offering a small hug. It inches closer to your hand, a bit less forlorn.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "Your pat goes unnoticed; the worm remains half-buried, looking droopy and unresponsive.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "Startled by your pat, the worm wriggles up too fast, flinging itself onto a dry patch, squirming uncomfortably!",
            "happiness": -3,
            "health": -1
          }
        ],
        "Angry": [
          {
            "type": "positive",
            "message": "You gently scoop up the worm, letting it coil in your palm before patting it softly. Eventually, it stops thrashing.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "Your worm flops furiously in the soil as you pat it, refusing to calm down or accept your attempt.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "It lashes about at your touch, tangling itself in loose earth. In its rage, it whips out and nearly splits a tiny root!",
            "happiness": -3,
            "health": -2
          }
        ],
        "Afraid": [
          {
            "type": "positive",
            "message": "You move very slowly, letting the worm sense your warmth. Eventually, it relaxes enough for a gentle pat along its body.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "Your sudden approach makes the worm recoil deeper into the soil, too scared to be patted.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "Spooked by your hand, the worm flails up and out of the container, landing with a splat on the table!",
            "happiness": -3,
            "health": -1
          }
        ],
        "Excited": [
          {
            "type": "positive",
            "message": "You pat the worm’s segments, and it wriggles in a joyful spin, as if celebrating your presence in its earthy realm.",
            "happiness": 6
          },
          {
            "type": "negative",
            "message": "Your worm is so giddy, it tunnels rapidly and barely lets you pat it at all, popping up in random spots.",
            "happiness": 2
          },
          {
            "type": "hurt",
            "message": "In its excitement, the worm flops out of your hand, smacking into a shovel handle with a squirmy thud!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Lonely": [
          {
            "type": "positive",
            "message": "You rest your hand in the soil. The worm edges closer, brushing your fingers as if seeking company, and you pat it softly.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "You try a comforting pat, but it just burrows deeper, longing for another worm companion instead.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "In a desperate attempt for closeness, the worm flings itself onto your hand but slips and tumbles onto a dry patch!",
            "happiness": -3,
            "health": -1
          }
        ],
        "Playful": [
          {
            "type": "positive",
            "message": "You wiggle your fingers in the soil, and the worm does a wriggly dance, letting you pat its plump body in mid-squirm.",
            "happiness": 6
          },
          {
            "type": "negative",
            "message": "Too busy performing its wriggle routine, the worm just flips around the dirt, ignoring your attempts to pat.",
            "happiness": 1
          },
          {
            "type": "hurt",
            "message": "The worm tries to follow your finger playfully but smacks headfirst into a small rock, dazing itself!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Annoyed": [
          {
            "type": "positive",
            "message": "You barely touch the worm’s body, giving it space. It writhes a bit but tolerates your presence.",
            "happiness": 3
          },
          {
            "type": "negative",
            "message": "You press your pat too firmly, and the worm flings itself away, squiggling in obvious annoyance.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "Your persistent pat makes the worm thrash, tangling itself in clumps of dirt before flopping out in a mini worm tantrum.",
            "happiness": -3,
            "health": -1
          }
        ],
        "Tired": [
          {
            "type": "positive",
            "message": "You lightly brush soil around the worm and pat it gently. It gives a half-hearted wriggle before resting again.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "No matter how you pat, the worm remains limp in the soil, too worn out to respond.",
            "happiness": 0
          },
          {
            "type": "hurt",
            "message": "Your pat jolts the worm unexpectedly, causing it to jolt upright and then collapse in a sluggish coil.",
            "happiness": -2,
            "health": -1
          }
        ],
        "Bored": [
          {
            "type": "positive",
            "message": "You shift some pebbles around, offering a fresh path. The worm perks up slightly, letting you pat it as it investigates.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "You try tapping the worm, but it just lies there, occasionally wriggling with bored disinterest.",
            "happiness": 1
          },
          {
            "type": "hurt",
            "message": "Hoping to entertain it, you swirl some water around. The worm tries to chase the flow but accidentally flops onto a dry spot!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Equal": [
          {
            "type": "positive",
            "message": "You place your hand at soil level, letting the worm crawl onto you by choice. It settles, allowing a respectful pat in return.",
            "happiness": 3
          },
          {
            "type": "negative",
            "message": "The worm acknowledges you only by slithering around your finger once, then continues its daily wriggle, seemingly unmoved.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You attempt a balanced pat, but the worm slides off your palm mid-pat, flopping onto a bit of gravel!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Curious": [
          {
            "type": "positive",
            "message": "You let the worm nuzzle your hand, and it eagerly explores each groove. It seems so intrigued it doesn't mind a gentle pat afterward.",
            "happiness": 5
          },
          {
            "type": "negative",
            "message": "The worm is too busy poking around the pot’s edges, ignoring your attempts to pat its squishy segments.",
            "happiness": 1
          },
          {
            "type": "hurt",
            "message": "While investigating your fingertip, the worm overreaches and tumbles off the container’s rim!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Relaxed": [
          {
            "type": "positive",
            "message": "You pat the worm lightly, and it glides through the soil with slow, content undulations, unbothered by your touch.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "Your worm is so calm it barely reacts, continuing its lazy inch-by-inch journey under the surface.",
            "happiness": 0
          },
          {
            "type": "hurt",
            "message": "You pat it a bit too enthusiastically, causing the worm to slip free of the soil and plop on your shoe, surprised!",
            "happiness": -2,
            "health": -1
          }
        ],
        "Embarrassed": [
          {
            "type": "positive",
            "message": "You gently stroke the worm, and it wriggles shyly, half-burying itself in the soil as if bashful about the attention.",
            "happiness": 2
          },
          {
            "type": "negative",
            "message": "Your gaze makes the worm recoil deeper into the dirt, seemingly too flustered to accept your pat.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "Flustered by your attention, the worm tries to slink away but knots itself awkwardly around a pebble!",
            "happiness": -3,
            "health": -1
          }
        ],
        "Nervous": [
          {
            "type": "positive",
            "message": "You keep still, letting the worm sense no threat. After a moment, it allows a gentle pat, trembling less with each movement.",
            "happiness": 4
          },
          {
            "type": "negative",
            "message": "Any small shift in your hand sends the worm burrowing in panic, too anxious to be patted.",
            "happiness": -2
          },
          {
            "type": "hurt",
            "message": "A sudden noise alarms the worm mid-pat, making it thrash out of the soil and flump onto the table surface!",
            "happiness": -4,
            "health": -2
          }
        ],
        "Unmotivated": [
          {
            "type": "positive",
            "message": "You gently tilt the worm’s body, patting it in a friendly nudge. It lazily resumes squirming through the soil.",
            "happiness": 3
          },
          {
            "type": "negative",
            "message": "No matter how you pat, the worm stays coiled in one place, showing zero interest in moving.",
            "happiness": -1
          },
          {
            "type": "hurt",
            "message": "You try to encourage it with a pat, but it flops sideways out of your hand, landing with a soft splat on dry ground!",
            "happiness": -2,
            "health": -1
          }
        ]
      }      
    }
  }
}
